Repository: lswiderski/mi-scale-exporter
Catalog: src/MiScaleExporter.MAUI/Resources/Localization/AppSnippets.*.resx
Languages: pl

# AboutGarmin
source: This application is an open source community project and I have no affiliation with Garmin.
pl: Ta aplikacja jest projektem społeczności open source i nie ma żadnych powiązań z firmą Garmin.

# AboutMeasureInstruction
source: Set the bluetooth address of the scale, and your data in the settings. Stand on your scale. Measure yourself. Mi Body Composition Scale is active up to 15 min after the measurement.
pl: Ustaw w ustawieniach adres bluetooth wagi, oraz swoje dane. Stań na swojej wadze. Zmierz się. Mi Body Composition Scale jest aktywna do 15 min po dokonaniu pomiaru.

# AboutMFAAndStoringData
source: The application now supports MFA/2FA security features. If you save credentials in settings, authorization tokens will be remembered and you won't be asked every time for MFA code.
pl: Aplikacja obsługuje teraz funkcje bezpieczeństwa MFA/2FA. Jeśli zapiszesz dane uwierzytelniające w ustawieniach, tokeny autoryzacyjne zostaną zapamiętane i nie będziesz za każdym razem proszony o podanie kodu MFA.

# AboutUpload
source: Then you can review your data and upload it to Garmin Cloud. If you do not have Mi scale and just want to manually insert the data, you can so.
pl: Następnie możesz przejrzeć swoje dane i przesłać je do Garmin Cloud. Jeśli nie masz wagi Mi Scale i możesz po prostu ręcznie wprowadzić dane i przesłac je do Garmin Connect.

source: Age
pl: Wiek

source: Alternate External API Address
pl: Alternatywny zewnętrzny adres API

source: App Settings
pl: Ustawienia aplikacji

# BasalMetabolosimKCal
source: Basal Metabolism (kCal):
pl: Metabolizm podstawowy (kCal):

source: Bluetooth Address
pl: Adres Bluetooth

source: Body age (years)
pl: Wiek ciała (w latach)

# BodyFatPercent
source: Body Fat (%)
pl: Tłuszcz w organizmie (%)

source: Body Type
pl: Typ Ciała

# BoneMassPercent
source: Bone mass (Kg)
pl: Masa kostna (Kg)

source: Buy me a coffee
pl: Postaw mi kawę

source: Cancel MFA Request
pl: Anuluj MFA

source: Cancel Search
pl: Anuluj wyszukiwanie

# CreatedBy
source: Created by Lukasz Swiderski 2023
pl: Stworzone przez Łukasza Świderskiego 2023

# DataCouldNotBeObtained
source: Data could not be obtained. try again
pl: Nie udało się uzyskać danych. Spróbuj ponownie

# DoYouLikeAndWouldYouLikeToSupport
source: Do you like this app and would you like to support it?
pl: Czy podoba Ci się ta aplikacja i chciałbyś ją wesprzeć?

source: Female
pl: Kobieta

source: Garmin Body Composition Form
pl: Formularz składu ciała Garmin

source: Garmin Form
pl: Formularz Garmin

source: Garmin Settings
pl: Ustawienia Garmin

source: Generate only .fit file
pl: Generuj tylko plik .fit

source: Go to scan
pl: Przejdź do skanowania

source: Height
pl: Wzrost

source: Help
pl: Pomoc

# HelpCoffee
source: 8. Coffee
pl: 8. Kawa

# HelpCoffeeDescription
source: Keep in mind that this is my hobby project. It was created for my inner needs and I believe it may be useful to others as well. I do not receive any compensation for creating and maintaining this project. If you want to support the development or thank me, you can buy me a coffee.
pl: Należy pamiętać, że jest to mój projekt hobbystyczny. Został on stworzony dla moich wewnętrznych potrzeb i wierzę, że może być przydatny również dla innych. Nie otrzymuję żadnego wynagrodzenia za stworzenie i utrzymanie tego projektu. Jeśli chcesz wesprzeć rozwój lub podziękować mi, możesz postawić mi kawę.

# HelpConnect
source: 1. How to connect to the scale
pl: 1. Jak podłączyć się do wagi

# HelpConnectDescription
source: Set the Bluetooth address of the scale in settings. Set the correct age/height/gender values. Measure yourself. The scale is active for up to 15 minutes after measurement.
pl: Ustawić adres Bluetooth wagi w ustawieniach. Ustaw prawidłowe wartości wieku/wzrostu/płci. Zmierz się. Waga jest aktywna i wysyła wyniki do 15 minut po pomiarze.

# HelpConnectDescription2
source: Bluetooth address can be found in Zepp Life > Profile > My devices > Mi Body Composition Scale > Bluetooth address (hold to copy)
pl: Adres Bluetooth można znaleźć w Zepp Life > Profil > Moje urządzenia > Mi Body Composition Scale > Adres Bluetooth (przytrzymaj, aby skopiować)

# HelpExternalApi
source: 5. External Api
pl: 5. Zewnętrzne Api

# HelpExternalApiDescription
source: External API is used as a proxy for older Android phones (9 or lower). The default address is https://frog01-20364.wykr.es/. You can host your own version of the API and this app will send the data to your system instead of Garmin. Check out the project repository for more information.
pl: Zewnętrzny interfejs API jest używany jako proxy dla starszych telefonów z systemem Android (9 lub niższy). Domyślny adres to https://frog01-20364.wykr.es/. Możesz hostować własną wersję API, a ta aplikacja wyśle dane do twojego systemu zamiast do Garmina. Sprawdź repozytorium projektu, aby uzyskać więcej informacji.

# HelpFeedback
source: 7. Feedback & Contact
pl: 7. Informacje zwrotne i kontakt

# HelpFeedbackDescription
source: If you found a bug, need a feature or have an idea, share it with me at the project repository.
pl: Jeśli znalazłeś błąd, potrzebujesz jakiejś funkcji lub masz pomysł, podziel się nim ze mną w repozytorium projektu.

# HelpGarminAndXiaomi
source: 6. Garmin and Xiaomi
pl: 6. Garmin i Xiaomi

# HelpGarminAndXiaomiDescription
source: This application is an open source community project and I have no affiliation with Garmin or Xiaomi. You use it at your own risk. You can always check out the source code on Github.
pl: Ta aplikacja jest otwarto-źródłowym projektem społeczności i nie ma żadnych powiązań z Garminem lub Xiaomi. Używasz jej na własne ryzyko. Zawsze możesz sprawdzić kod źródłowy na Githubie.

# HelpHowItWorks
source: 2. How It works
pl: 2. Jak to działa

# HelpHowItWorksDescription
source: This App pass your data, email and password directly to Garmin Cloud or via external API server. The API does not store or log anything, it's just a middleware between this App and Garmin services.
pl: Ta aplikacja przekazuje Twoje dane, email i hasło bezpośrednio do Garmin Cloud lub poprzez zewnętrzny serwer API. API nie przechowuje ani nie rejestruje niczego, jest to tylko pośrednikiem pomiędzy aplikacją a usługami firmy Garmin.

# HelpStrangeResults
source: 3. Strange results? (Like 10kg only)
pl: 3. Dziwne wyniki? (Np zwraca małe wartości jak 10kg)

# HelpStrangeResultsDescription
source: If you have the Mi Body Composition Scale 2. Disable the 'Weight small object' option in Zepp Life
pl: Jeśli posiadasz Mi Body Composition Scale 2. Wyłącz opcję "Waż mały obiekt" w Zepp Life

# HelpZeppLifeDriference
source: 4. Results different from Zepp Life
pl: 4. Wyniki różne od Zepp Life

# HelpZeppLifeDriferenceDescription
source: Please check the age/height/gender parameters - should be identical in both apps. But even then, the values may be slightly different because we do not use the exact algorithm used by Xiaomi, but an alternative open source algorithm.
pl: Sprawdź parametry wieku/wzrostui/płci - powinny być identyczne w obu aplikacjach. Ale nawet wtedy wartości mogą być nieco inne, ponieważ nie używamy dokładnie takiego samego algorytmu jak Xiaomi, ale alternatywnego algorytmu open source.

source: Ideal Weight (Kg):
pl: Idealna masa ciała (Kg):

source: Male
pl: Mężczyzna

source: MFA Code
pl: Kod MFA

source: Mi Scale Data
pl: Dane Mi Scale

# MuscleMassAsPercentage
source: Muscle mass as %
pl: Masa mięśniowa jako %

source: Muscle Mass (Kg)
pl: Masa mięśniowa (Kg)

# MuscleMassPer
source: Muscle Mass (%)
pl: Masa mięśniowa (%)

source: Not found
pl: Nie znaleziono

source: One click - Scan & Upload
pl: Jedno kliknięcie - skanowanie i przesyłanie

source: Open Help
pl: Otwórz pomoc

source: Password
pl: Hasło

# PermissionBluetoothRequired
source: Permission to use Bluetooth is required to scan.
pl: Do skanowania wymagana jest zgoda na korzystanie z Bluetooth.

# PermissionLocationRequired
source: Permission to use Location (Bluetooth) is required to scan.
pl: Do skanowania wymagane jest pozwolenie na korzystanie z funkcji Lokalizacji (Bluetooth).

# ProteinPercent
source: Protein (%):
pl: Białko (%):

source: Reset to Default
pl: Przywrócenie ustawień domyślnych

source: Response
pl: Odpowiedź

source: Scale Model
pl: Model Wagi

source: Scale Settings
pl: Ustawienia wagi

source: Scanning...
pl: Skanowanie...

source: Settings
pl: Ustawienia

# SettingsHideAds
source: Hide Ads Banner
pl: Schowaj reklamy

source: Sex
pl: Płeć

# ShowDebug
source: Show Debug Info during scan
pl: Pokaż informacje debug podczas skanowania

source: Stop Measure
pl: Zatrzymaj pomiar

source: Time of measurement
pl: Czas pomiaru

source: Uploaded
pl: Przesłano

source: Uploading...
pl: Wysyłanie...

source: Upload to Garmin Cloud
pl: Prześlij do usługi Garmin Cloud

source: Use External API
pl: Użyj zewnętrznego API

source: Values that will not be sent to the cloud:
pl: Wartości, które nie będą wysyłane do chmury:

source: Visceral fat
pl: Tłuszcz trzewny

# VisitProjectRepository
source: Visit the project repository
pl: Odwiedź repozytorium projektu

# WaterPercent
source: Water (%)
pl: Woda (%)

source: Weight (Kg)
pl: Waga (Kg)
